Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum
The different circle colors.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.YELLOW_RED
The yellow/red color.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.BLACK
The black color.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.WHITE
The white color.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.RED
The red color.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.GREEN
The green color.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.BLUE
The blue color.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.CYAN
The cyan color.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.YELLOW
The yellow color.

Tekla.Structures.Model.ControlCircle.ControlCircleColorEnum.MAGENTA
The magenta color.